# Big Data by Prof. Bharti Motwani 
## Lecture 1
19/2/22 2-4 PM
1.	MySQL, R, Jupyter Notebook
2.	Python on Jupyter Notebook

import is keyword to import library in Python
os is operating system is a library

In [1]:
import os
os.getcwd() #gives current working directory, tells us where python has accessed

'E:\\SDSF\\Second Semester\\Big Data'

In [3]:
import pandas
data=pandas.read_csv('IBMdata.csv')
data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [4]:
data.shape #tells us about the number of rows and columns

(1470, 35)

In [6]:
data.shape() #is wrong

TypeError: 'tuple' object is not callable

In [9]:
data.head(2) #argument specifies number of records to display by default its 5

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7

In [10]:
import sqlalchemy

ModuleNotFoundError: No module named 'sqlalchemy'

In [11]:
pip install sqlalchemy

Collecting sqlalchemyNote: you may need to restart the kernel to use updated packages.

  Downloading SQLAlchemy-1.4.34-cp310-cp310-win_amd64.whl (1.6 MB)
     ---------------------------------------- 1.6/1.6 MB 3.1 MB/s eta 0:00:00
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp310-cp310-win_amd64.whl (101 kB)
     -------------------------------------- 102.0/102.0 KB 5.7 MB/s eta 0:00:00
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.2 sqlalchemy-1.4.34

In [13]:
import sqlalchemy #library for SQL which helps us to perform SQL commands on data

In [23]:
engine=sqlalchemy.create_engine('sqlite://',echo=False)

In [24]:
data.to_sql('mytable',con=engine)

1470

In [25]:
engine.execute("select * from mytable").fetchone()

(0, 41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5)

In [28]:
# engine.execute("select * from employee") #write down the query
# fetchone --> one only, fetch all --> 5 records

In [29]:
result = engine.execute("select * from mytable limit 5").fetchall()

In [30]:
for i in result:
    print(i)

(0, 41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5)
(1, 49, 'No', 'Travel_Frequently', 279, 'Research & Development', 8, 1, 'Life Sciences', 1, 2, 3, 'Male', 61, 2, 2, 'Research Scientist', 2, 'Married', 5130, 24907, 1, 'Y', 'No', 23, 4, 4, 80, 1, 10, 3, 3, 10, 7, 1, 7)
(2, 37, 'Yes', 'Travel_Rarely', 1373, 'Research & Development', 2, 2, 'Other', 1, 4, 4, 'Male', 92, 2, 1, 'Laboratory Technician', 3, 'Single', 2090, 2396, 6, 'Y', 'Yes', 15, 3, 2, 80, 0, 7, 3, 3, 0, 0, 0, 0)
(3, 33, 'No', 'Travel_Frequently', 1392, 'Research & Development', 3, 4, 'Life Sciences', 1, 5, 4, 'Female', 56, 3, 1, 'Research Scientist', 3, 'Married', 2909, 23159, 1, 'Y', 'Yes', 11, 3, 3, 80, 0, 8, 3, 3, 8, 7, 3, 0)
(4, 27, 'No', 'Travel_Rarely', 591, 'Research & Development', 2, 1, 'Medical', 1, 7, 1, 'Male', 40, 3, 1, 'Laboratory Technician', 2, 'Married', 3468, 16632, 9, 'Y', 'No', 12, 3, 4, 80, 1, 6, 3, 3, 2, 2, 2, 2)

In [39]:
query = 'select * from mytable where age >50 limit 2'
result = engine.execute(query)

In [40]:
result

In [41]:
for i in result:
    print(i)

(6, 59, 'No', 'Travel_Rarely', 1324, 'Research & Development', 3, 3, 'Medical', 1, 10, 3, 'Female', 81, 4, 1, 'Laboratory Technician', 1, 'Married', 2670, 9964, 4, 'Y', 'Yes', 20, 4, 1, 80, 3, 12, 3, 2, 1, 0, 0, 0)
(18, 53, 'No', 'Travel_Rarely', 1219, 'Sales', 2, 4, 'Life Sciences', 1, 23, 1, 'Female', 78, 2, 4, 'Manager', 4, 'Married', 15427, 22021, 2, 'Y', 'No', 16, 3, 3, 80, 0, 31, 3, 3, 25, 8, 3, 7)

## Relational Operators 
Operators >, <, =, !>,!<,>=,<=,!>=,!<=

## Logical Operators

In [45]:
result = engine.execute("select * from mytable where age>50 and DailyRate>1300 limit 3").fetchall()

In [46]:
for i in result:
    print(i)

(6, 59, 'No', 'Travel_Rarely', 1324, 'Research & Development', 3, 3, 'Medical', 1, 10, 3, 'Female', 81, 4, 1, 'Laboratory Technician', 1, 'Married', 2670, 9964, 4, 'Y', 'Yes', 20, 4, 1, 80, 3, 12, 3, 2, 1, 0, 0, 0)
(63, 59, 'No', 'Travel_Rarely', 1435, 'Sales', 25, 3, 'Life Sciences', 1, 81, 1, 'Female', 99, 3, 3, 'Sales Executive', 1, 'Single', 7637, 2354, 7, 'Y', 'No', 11, 3, 4, 80, 0, 28, 3, 2, 21, 16, 7, 9)
(85, 56, 'No', 'Travel_Rarely', 1400, 'Research & Development', 7, 3, 'Life Sciences', 1, 112, 4, 'Male', 49, 1, 3, 'Manufacturing Director', 4, 'Single', 7260, 21698, 4, 'Y', 'No', 11, 3, 1, 80, 0, 37, 3, 2, 6, 4, 0, 2)

In [63]:
result = engine.execute("select * from mytable where department='Sales' and age>20 and DailyRate>1300 limit 3").fetchall()
result

[(52, 44, 'No', 'Travel_Rarely', 1488, 'Sales', 1, 5, 'Marketing', 1, 68, 2, 'Female', 75, 3, 2, 'Sales Executive', 1, 'Divorced', 5454, 4009, 5, 'Y', 'Yes', 21, 4, 3, 80, 1, 9, 2, 2, 4, 3, 1, 3),
 (54, 26, 'No', 'Travel_Rarely', 1443, 'Sales', 23, 3, 'Marketing', 1, 72, 3, 'Female', 47, 2, 2, 'Sales Executive', 4, 'Married', 4157, 21436, 7, 'Y', 'Yes', 19, 3, 3, 80, 1, 5, 2, 2, 2, 2, 0, 0),
 (63, 59, 'No', 'Travel_Rarely', 1435, 'Sales', 25, 3, 'Life Sciences', 1, 81, 1, 'Female', 99, 3, 3, 'Sales Executive', 1, 'Single', 7637, 2354, 7, 'Y', 'No', 11, 3, 4, 80, 0, 28, 3, 2, 21, 16, 7, 9)]

In [64]:
for i in result:
    print(i)

(52, 44, 'No', 'Travel_Rarely', 1488, 'Sales', 1, 5, 'Marketing', 1, 68, 2, 'Female', 75, 3, 2, 'Sales Executive', 1, 'Divorced', 5454, 4009, 5, 'Y', 'Yes', 21, 4, 3, 80, 1, 9, 2, 2, 4, 3, 1, 3)
(54, 26, 'No', 'Travel_Rarely', 1443, 'Sales', 23, 3, 'Marketing', 1, 72, 3, 'Female', 47, 2, 2, 'Sales Executive', 4, 'Married', 4157, 21436, 7, 'Y', 'Yes', 19, 3, 3, 80, 1, 5, 2, 2, 2, 2, 0, 0)
(63, 59, 'No', 'Travel_Rarely', 1435, 'Sales', 25, 3, 'Life Sciences', 1, 81, 1, 'Female', 99, 3, 3, 'Sales Executive', 1, 'Single', 7637, 2354, 7, 'Y', 'No', 11, 3, 4, 80, 0, 28, 3, 2, 21, 16, 7, 9)

In [65]:
ans = engine.execute("select * from mytable where department = 'Sales' or age>58 limit 4").fetchall()
ans

[(0, 41, 'Yes', 'Travel_Rarely', 1102, 'Sales', 1, 2, 'Life Sciences', 1, 1, 2, 'Female', 94, 3, 2, 'Sales Executive', 4, 'Single', 5993, 19479, 8, 'Y', 'Yes', 11, 3, 1, 80, 0, 8, 0, 1, 6, 4, 0, 5),
 (6, 59, 'No', 'Travel_Rarely', 1324, 'Research & Development', 3, 3, 'Medical', 1, 10, 3, 'Female', 81, 4, 1, 'Laboratory Technician', 1, 'Married', 2670, 9964, 4, 'Y', 'Yes', 20, 4, 1, 80, 3, 12, 3, 2, 1, 0, 0, 0),
 (18, 53, 'No', 'Travel_Rarely', 1219, 'Sales', 2, 4, 'Life Sciences', 1, 23, 1, 'Female', 78, 2, 4, 'Manager', 4, 'Married', 15427, 22021, 2, 'Y', 'No', 16, 3, 3, 80, 0, 31, 3, 3, 25, 8, 3, 7),
 (21, 36, 'Yes', 'Travel_Rarely', 1218, 'Sales', 9, 4, 'Life Sciences', 1, 27, 3, 'Male', 82, 2, 1, 'Sales Representative', 1, 'Single', 3407, 6986, 7, 'Y', 'No', 23, 4, 2, 80, 0, 10, 4, 3, 5, 3, 0, 3)]

## in
in : for multiple condition to test
1. not in
2. between, a, and, in, not in, min, max
3. not equal to: age!=22

# Lecture 2
Install MongoDB Software

Table is a Structured Data
Big Data
1. Structured Data e.g. Excel-columns and rows
2. Semi-structured Data
3. Unstructured Data

Each and every action is stored in Facebook, even every click of mouse

Unstructured Data Type 
json: javascript notation 
1. starts with {}
2. everything with key value pair
3. key and value has to be in double quotes (for string), no quote (for no.)
4. for multiple values we use ,
Example -
    { 
        "name":"Bharti",
        "age":46,
        "qualification":"PhD",
        "city":"Mumbai"
        }
JSON File extension saved

For multiple option we use [ ]

### Create a json file